Catalogs/Произведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Произведения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Связь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Произведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Визуализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Картинки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тело</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>45</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Произведения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	Объект.Тело.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВТЧ(Команда)
	
	ДанныеДляНаполненияТЧ = ЭтаФорма.ТекстДляЗаполнения;
	Если НЕ ЗначениеЗаполнено(ДанныеДляНаполненияТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексКолонки 	= ЭтаФорма.КакуюКолонкуОбработать;
	РежимНаполнения	= ЭтаФорма.РежимНаполнения;
	ИмяРеквизита 	= ПолучитьИмяРеквизитаДляРедактирования(ИндексКолонки);
	
	мДанных = СтрРазделить(ДанныеДляНаполненияТЧ, Символы.ПС, ЛОЖЬ);
	
	Если НЕ РежимНаполнения Тогда
		
		Для каждого СтрокаДанных Из мДанных Цикл			
			Если НЕ ЗначениеЗаполнено(СтрокаДанных) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Тело.Добавить();
			НоваяСтрока[ИмяРеквизита] = СтрокаДанных;			
		КонецЦикла;
		
	Иначе
		
		ИтераторВходныхДанных 	= 0;
		ИтераторВыходныхДанных 	= 0;
		Пока ИтераторВыходныхДанных < Объект.Тело.Количество() Цикл
			Если ИтераторВходныхДанных > мДанных.Количество() Тогда
				Прервать;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(мДанных[ИтераторВходныхДанных]) Тогда
				ИтераторВходныхДанных = ИтераторВходныхДанных 	+ 1;
				Продолжить;
			КонецЕсли;
			
			Объект.Тело[ИтераторВыходныхДанных][ИмяРеквизита] = мДанных[ИтераторВходныхДанных];
			
			ИтераторВходныхДанных 	= ИтераторВходныхДанных 	+ 1;
			ИтераторВыходныхДанных 	= ИтераторВыходныхДанных 	+ 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяРеквизитаДляРедактирования(ИндексЭлемента)

	ИмяРеквизита = Новый Массив;
	ИмяРеквизита.Добавить("СтрокаДанных");
	ИмяРеквизита.Добавить("Подсказка");
	
	Возврат ИмяРеквизита[ИндексЭлемента];

КонецФункции // ПолучитьИмяРеквизитаДляРедактирования()
